Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/rot.h
/** \brief ROT register offsets definitions */
#define ROT_SECCFG_REG_OFST            _UINT32_(0x00)      /* (ROT_SECCFG) Secure Configuration HOLDING REGISTER1,2 Offset */
#define ROT_ANTIROLLBACKCOUNTER_REG_OFST _UINT32_(0x04)      /* (ROT_ANTIROLLBACKCOUNTER) Anti Roll back counter Offset */
#define ROT_ANTIROLLBACKCOUNTER0_REG_OFST _UINT32_(0x04)      /* (ROT_ANTIROLLBACKCOUNTER0) Anti Roll back counter Offset */
#define ROT_ANTIROLLBACKCOUNTER1_REG_OFST _UINT32_(0x08)      /* (ROT_ANTIROLLBACKCOUNTER1) Anti Roll back counter Offset */
#define ROT_ANTIROLLBACKCOUNTER2_REG_OFST _UINT32_(0x0C)      /* (ROT_ANTIROLLBACKCOUNTER2) Anti Roll back counter Offset */
#define ROT_ANTIROLLBACKCOUNTER3_REG_OFST _UINT32_(0x10)      /* (ROT_ANTIROLLBACKCOUNTER3) Anti Roll back counter Offset */
#define ROT_ANTIROLLBACKCOUNTER4_REG_OFST _UINT32_(0x14)      /* (ROT_ANTIROLLBACKCOUNTER4) Anti Roll back counter Offset */
#define ROT_ANTIROLLBACKCOUNTER5_REG_OFST _UINT32_(0x18)      /* (ROT_ANTIROLLBACKCOUNTER5) Anti Roll back counter Offset */
#define ROT_ANTIROLLBACKCOUNTER6_REG_OFST _UINT32_(0x1C)      /* (ROT_ANTIROLLBACKCOUNTER6) Anti Roll back counter Offset */
#define ROT_ANTIROLLBACKCOUNTER7_REG_OFST _UINT32_(0x20)      /* (ROT_ANTIROLLBACKCOUNTER7) Anti Roll back counter Offset */
#define ROT_LIFECYCLECTR_BOOTKEY_REG_OFST _UINT32_(0x24)      /* (ROT_LIFECYCLECTR_BOOTKEY) Life cycle counter and Secure boot key LSB bytes Offset */
#define ROT_SECUREBOOTKEY_3_46_REG_OFST _UINT32_(0x28)      /* (ROT_SECUREBOOTKEY_3_46) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_3_46_0_REG_OFST _UINT32_(0x28)      /* (ROT_SECUREBOOTKEY_3_46_0) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_3_46_1_REG_OFST _UINT32_(0x2C)      /* (ROT_SECUREBOOTKEY_3_46_1) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_3_46_2_REG_OFST _UINT32_(0x30)      /* (ROT_SECUREBOOTKEY_3_46_2) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_3_46_3_REG_OFST _UINT32_(0x34)      /* (ROT_SECUREBOOTKEY_3_46_3) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_3_46_4_REG_OFST _UINT32_(0x38)      /* (ROT_SECUREBOOTKEY_3_46_4) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_3_46_5_REG_OFST _UINT32_(0x3C)      /* (ROT_SECUREBOOTKEY_3_46_5) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_3_46_6_REG_OFST _UINT32_(0x40)      /* (ROT_SECUREBOOTKEY_3_46_6) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_3_46_7_REG_OFST _UINT32_(0x44)      /* (ROT_SECUREBOOTKEY_3_46_7) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_3_46_8_REG_OFST _UINT32_(0x48)      /* (ROT_SECUREBOOTKEY_3_46_8) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_3_46_9_REG_OFST _UINT32_(0x4C)      /* (ROT_SECUREBOOTKEY_3_46_9) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_3_46_10_REG_OFST _UINT32_(0x50)      /* (ROT_SECUREBOOTKEY_3_46_10) Secure boot key Offset */
#define ROT_SECUREBOOTKEY_47_48_STORAGE_KEY_REG_OFST _UINT32_(0x54)      /* (ROT_SECUREBOOTKEY_47_48_STORAGE_KEY) Secure boot key, Storage Key Offset */
#define ROT_STORAGE_KEY_3_30_REG_OFST  _UINT32_(0x58)      /* (ROT_STORAGE_KEY_3_30) Storage Key Offset */
#define ROT_STORAGE_KEY_3_30_0_REG_OFST _UINT32_(0x58)      /* (ROT_STORAGE_KEY_3_30_0) Storage Key Offset */
#define ROT_STORAGE_KEY_3_30_1_REG_OFST _UINT32_(0x5C)      /* (ROT_STORAGE_KEY_3_30_1) Storage Key Offset */
#define ROT_STORAGE_KEY_3_30_2_REG_OFST _UINT32_(0x60)      /* (ROT_STORAGE_KEY_3_30_2) Storage Key Offset */
#define ROT_STORAGE_KEY_3_30_3_REG_OFST _UINT32_(0x64)      /* (ROT_STORAGE_KEY_3_30_3) Storage Key Offset */
#define ROT_STORAGE_KEY_3_30_4_REG_OFST _UINT32_(0x68)      /* (ROT_STORAGE_KEY_3_30_4) Storage Key Offset */
#define ROT_STORAGE_KEY_3_30_5_REG_OFST _UINT32_(0x6C)      /* (ROT_STORAGE_KEY_3_30_5) Storage Key Offset */
#define ROT_STORAGE_KEY_3_30_6_REG_OFST _UINT32_(0x70)      /* (ROT_STORAGE_KEY_3_30_6) Storage Key Offset */
#define ROT_STORAGE_KEY_FFCFG_REG_OFST _UINT32_(0x74)      /* (ROT_STORAGE_KEY_FFCFG) Storage Key, FFCFG Offset */
#define ROT_DEVICE_ID_PATCH_CFG_REG_OFST _UINT32_(0x78)      /* (ROT_DEVICE_ID_PATCH_CFG) Device ID and Patch CFG Offset */
#define ROT_PATCH_CFG_REG_OFST         _UINT32_(0x7C)      /* (ROT_PATCH_CFG) Patch CFG Offset */
#define ROT_PATCH_CODE_REG_OFST        _UINT32_(0x80)      /* (ROT_PATCH_CODE) Patch Code Offset */
#define ROT_PATCH_CODE0_REG_OFST       _UINT32_(0x80)      /* (ROT_PATCH_CODE0) Patch Code Offset */
#define ROT_PATCH_CODE1_REG_OFST       _UINT32_(0x84)      /* (ROT_PATCH_CODE1) Patch Code Offset */
#define ROT_PATCH_CODE2_REG_OFST       _UINT32_(0x88)      /* (ROT_PATCH_CODE2) Patch Code Offset */
#define ROT_PATCH_CODE3_REG_OFST       _UINT32_(0x8C)      /* (ROT_PATCH_CODE3) Patch Code Offset */
#define ROT_PATCH_CODE4_REG_OFST       _UINT32_(0x90)      /* (ROT_PATCH_CODE4) Patch Code Offset */
#define ROT_PATCH_CODE5_REG_OFST       _UINT32_(0x94)      /* (ROT_PATCH_CODE5) Patch Code Offset */
#define ROT_PATCH_CODE6_REG_OFST       _UINT32_(0x98)      /* (ROT_PATCH_CODE6) Patch Code Offset */
#define ROT_PATCH_CODE7_REG_OFST       _UINT32_(0x9C)      /* (ROT_PATCH_CODE7) Patch Code Offset */
#define ROT_PATCH_CODE8_REG_OFST       _UINT32_(0xA0)      /* (ROT_PATCH_CODE8) Patch Code Offset */
#define ROT_PATCH_CODE9_REG_OFST       _UINT32_(0xA4)      /* (ROT_PATCH_CODE9) Patch Code Offset */
#define ROT_PATCH_CODE10_REG_OFST      _UINT32_(0xA8)      /* (ROT_PATCH_CODE10) Patch Code Offset */
#define ROT_PATCH_CODE11_REG_OFST      _UINT32_(0xAC)      /* (ROT_PATCH_CODE11) Patch Code Offset */
#define ROT_PATCH_CODE12_REG_OFST      _UINT32_(0xB0)      /* (ROT_PATCH_CODE12) Patch Code Offset */
#define ROT_PATCH_CODE13_REG_OFST      _UINT32_(0xB4)      /* (ROT_PATCH_CODE13) Patch Code Offset */
#define ROT_PATCH_CODE14_REG_OFST      _UINT32_(0xB8)      /* (ROT_PATCH_CODE14) Patch Code Offset */
#define ROT_PATCH_CODE15_REG_OFST      _UINT32_(0xBC)      /* (ROT_PATCH_CODE15) Patch Code Offset */
#define ROT_PATCH_CODE16_REG_OFST      _UINT32_(0xC0)      /* (ROT_PATCH_CODE16) Patch Code Offset */
#define ROT_PATCH_CODE17_REG_OFST      _UINT32_(0xC4)      /* (ROT_PATCH_CODE17) Patch Code Offset */
#define ROT_PATCH_CODE18_REG_OFST      _UINT32_(0xC8)      /* (ROT_PATCH_CODE18) Patch Code Offset */
#define ROT_PATCH_CODE19_REG_OFST      _UINT32_(0xCC)      /* (ROT_PATCH_CODE19) Patch Code Offset */
#define ROT_PATCH_CODE20_REG_OFST      _UINT32_(0xD0)      /* (ROT_PATCH_CODE20) Patch Code Offset */
#define ROT_PATCH_CODE21_REG_OFST      _UINT32_(0xD4)      /* (ROT_PATCH_CODE21) Patch Code Offset */
#define ROT_PATCH_CODE22_REG_OFST      _UINT32_(0xD8)      /* (ROT_PATCH_CODE22) Patch Code Offset */
#define ROT_PATCH_CODE23_REG_OFST      _UINT32_(0xDC)      /* (ROT_PATCH_CODE23) Patch Code Offset */
#define ROT_PATCH_CODE24_REG_OFST      _UINT32_(0xE0)      /* (ROT_PATCH_CODE24) Patch Code Offset */
#define ROT_PATCH_CODE25_REG_OFST      _UINT32_(0xE4)      /* (ROT_PATCH_CODE25) Patch Code Offset */
#define ROT_PATCH_CODE26_REG_OFST      _UINT32_(0xE8)      /* (ROT_PATCH_CODE26) Patch Code Offset */
#define ROT_PATCH_CODE27_REG_OFST      _UINT32_(0xEC)      /* (ROT_PATCH_CODE27) Patch Code Offset */
#define ROT_PATCH_CODE28_REG_OFST      _UINT32_(0xF0)      /* (ROT_PATCH_CODE28) Patch Code Offset */
#define ROT_PATCH_CODE29_REG_OFST      _UINT32_(0xF4)      /* (ROT_PATCH_CODE29) Patch Code Offset */
#define ROT_PATCH_CODE30_REG_OFST      _UINT32_(0xF8)      /* (ROT_PATCH_CODE30) Patch Code Offset */
#define ROT_PATCH_CODE31_REG_OFST      _UINT32_(0xFC)      /* (ROT_PATCH_CODE31) Patch Code Offset */
#define ROT_PATCH_CODE32_REG_OFST      _UINT32_(0x100)     /* (ROT_PATCH_CODE32) Patch Code Offset */
#define ROT_PATCH_CODE33_REG_OFST      _UINT32_(0x104)     /* (ROT_PATCH_CODE33) Patch Code Offset */
#define ROT_PATCH_CODE34_REG_OFST      _UINT32_(0x108)     /* (ROT_PATCH_CODE34) Patch Code Offset */
#define ROT_PATCH_CODE35_REG_OFST      _UINT32_(0x10C)     /* (ROT_PATCH_CODE35) Patch Code Offset */
#define ROT_PATCH_CODE36_REG_OFST      _UINT32_(0x110)     /* (ROT_PATCH_CODE36) Patch Code Offset */
#define ROT_PATCH_CODE37_REG_OFST      _UINT32_(0x114)     /* (ROT_PATCH_CODE37) Patch Code Offset */
#define ROT_PATCH_CODE38_REG_OFST      _UINT32_(0x118)     /* (ROT_PATCH_CODE38) Patch Code Offset */
#define ROT_PATCH_CODE39_REG_OFST      _UINT32_(0x11C)     /* (ROT_PATCH_CODE39) Patch Code Offset */
#define ROT_PATCH_CODE40_REG_OFST      _UINT32_(0x120)     /* (ROT_PATCH_CODE40) Patch Code Offset */
#define ROT_PATCH_CODE41_REG_OFST      _UINT32_(0x124)     /* (ROT_PATCH_CODE41) Patch Code Offset */
#define ROT_PATCH_CODE42_REG_OFST      _UINT32_(0x128)     /* (ROT_PATCH_CODE42) Patch Code Offset */
#define ROT_PATCH_CODE43_REG_OFST      _UINT32_(0x12C)     /* (ROT_PATCH_CODE43) Patch Code Offset */
#define ROT_PATCH_CODE44_REG_OFST      _UINT32_(0x130)     /* (ROT_PATCH_CODE44) Patch Code Offset */
#define ROT_PATCH_CODE45_REG_OFST      _UINT32_(0x134)     /* (ROT_PATCH_CODE45) Patch Code Offset */
#define ROT_PATCH_CODE46_REG_OFST      _UINT32_(0x138)     /* (ROT_PATCH_CODE46) Patch Code Offset */
#define ROT_PATCH_CODE47_REG_OFST      _UINT32_(0x13C)     /* (ROT_PATCH_CODE47) Patch Code Offset */
#define ROT_PATCH_CODE48_REG_OFST      _UINT32_(0x140)     /* (ROT_PATCH_CODE48) Patch Code Offset */
#define ROT_PATCH_CODE49_REG_OFST      _UINT32_(0x144)     /* (ROT_PATCH_CODE49) Patch Code Offset */
#define ROT_PATCH_CODE50_REG_OFST      _UINT32_(0x148)     /* (ROT_PATCH_CODE50) Patch Code Offset */
#define ROT_PATCH_CODE51_REG_OFST      _UINT32_(0x14C)     /* (ROT_PATCH_CODE51) Patch Code Offset */
#define ROT_PATCH_CODE52_REG_OFST      _UINT32_(0x150)     /* (ROT_PATCH_CODE52) Patch Code Offset */
#define ROT_PATCH_CODE53_REG_OFST      _UINT32_(0x154)     /* (ROT_PATCH_CODE53) Patch Code Offset */
#define ROT_PATCH_CODE54_REG_OFST      _UINT32_(0x158)     /* (ROT_PATCH_CODE54) Patch Code Offset */
#define ROT_PATCH_CODE55_REG_OFST      _UINT32_(0x15C)     /* (ROT_PATCH_CODE55) Patch Code Offset */
#define ROT_PATCH_CODE56_REG_OFST      _UINT32_(0x160)     /* (ROT_PATCH_CODE56) Patch Code Offset */
#define ROT_PATCH_CODE57_REG_OFST      _UINT32_(0x164)     /* (ROT_PATCH_CODE57) Patch Code Offset */
#define ROT_PATCH_CODE58_REG_OFST      _UINT32_(0x168)     /* (ROT_PATCH_CODE58) Patch Code Offset */
#define ROT_PATCH_CODE59_REG_OFST      _UINT32_(0x16C)     /* (ROT_PATCH_CODE59) Patch Code Offset */
#define ROT_UUID_REG_OFST              _UINT32_(0x170)     /* (ROT_UUID) Unique ID Offset */
#define ROT_UUID0_REG_OFST             _UINT32_(0x170)     /* (ROT_UUID0) Unique ID Offset */
#define ROT_UUID1_REG_OFST             _UINT32_(0x174)     /* (ROT_UUID1) Unique ID Offset */
#define ROT_UUID2_REG_OFST             _UINT32_(0x178)     /* (ROT_UUID2) Unique ID Offset */
#define ROT_UUID3_REG_OFST             _UINT32_(0x17C)     /* (ROT_UUID3) Unique ID Offset */
#define ROT_SEC_BOOT_REG_OFST          _UINT32_(0xC00)     /* (ROT_SEC_BOOT) Secure Boot Register Offset */
#define ROT_EFUSE_RWDATA_REG_OFST      _UINT32_(0xC04)     /* (ROT_EFUSE_RWDATA) EFuse RW Data Register Offset */
#define ROT_EFUSE_CON_REG_OFST         _UINT32_(0xC08)     /* (ROT_EFUSE_CON) Efuse Configuration Register2 Offset */

