Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/rot.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief ROT register API structure */
typedef struct
{  /* Secure Root of Trust Macro */
  __IO  uint32_t                       ROT_SECCFG;         /**< Offset: 0x00 (R/W  32) Secure Configuration HOLDING REGISTER1,2 */
  __IO  uint32_t                       ROT_ANTIROLLBACKCOUNTER[8]; /**< Offset: 0x04 (R/W  32) Anti Roll back counter */
  __IO  uint32_t                       ROT_LIFECYCLECTR_BOOTKEY; /**< Offset: 0x24 (R/W  32) Life cycle counter and Secure boot key LSB bytes */
  __IO  uint32_t                       ROT_SECUREBOOTKEY_3_46[11]; /**< Offset: 0x28 (R/W  32) Secure boot key */
  __IO  uint32_t                       ROT_SECUREBOOTKEY_47_48_STORAGE_KEY; /**< Offset: 0x54 (R/W  32) Secure boot key, Storage Key */
  __IO  uint32_t                       ROT_STORAGE_KEY_3_30[7]; /**< Offset: 0x58 (R/W  32) Storage Key */
  __IO  uint32_t                       ROT_STORAGE_KEY_FFCFG; /**< Offset: 0x74 (R/W  32) Storage Key, FFCFG */
  __IO  uint32_t                       ROT_DEVICE_ID_PATCH_CFG; /**< Offset: 0x78 (R/W  32) Device ID and Patch CFG */
  __IO  uint32_t                       ROT_PATCH_CFG;      /**< Offset: 0x7C (R/W  32) Patch CFG */
  __IO  uint32_t                       ROT_PATCH_CODE[60]; /**< Offset: 0x80 (R/W  32) Patch Code */
  __IO  uint32_t                       ROT_UUID[4];        /**< Offset: 0x170 (R/W  32) Unique ID */
  __I   uint8_t                        Reserved1[0xA80];
  __IO  uint32_t                       ROT_SEC_BOOT;       /**< Offset: 0xC00 (R/W  32) Secure Boot Register */
  __IO  uint32_t                       ROT_EFUSE_RWDATA;   /**< Offset: 0xC04 (R/W  32) EFuse RW Data Register */
  __IO  uint32_t                       ROT_EFUSE_CON;      /**< Offset: 0xC08 (R/W  32) Efuse Configuration Register2 */
} rot_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _WBZ65_ROT_COMPONENT_H_ */
